//
//  RateCalculationMode.swift
//  SKAbstractions
//
//  Created by Vitalii Sosin on 10.09.2024.
//

import Foundation

/// Перечисление для типов расчета валютных курсов.
///
/// `RateCalculationMode` определяет два типа расчета:
/// - `direct`: Сколько единиц другой валюты можно купить за одну единицу базовой.
/// - `inverse`: Сколько единиц базовой валюты нужно для покупки одной единицы другой валюты.
public enum RateCalculationMode {
  
  /// Прямой расчет.
  ///
  /// Показывает, сколько единиц другой валюты можно купить за одну единицу базовой.
  case direct
  
  /// Обратный расчет.
  ///
  /// Показывает, сколько единиц базовой валюты нужно для покупки одной единицы другой валюты.
  case inverse
}
